Revit 2026 API

# IFCData Operators

---

The IFCData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equality(IFCData, IFCData) | Determines whether two IFCDatas are the same. |
|  | Inequality(IFCData, IFCData) | Determines whether two IFCDatas are different. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace